Tutorials/incompressible/meshMotion/oscillatingInlet/0.orig/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform -0.000990521;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    defaultFaces
    {
        type            empty;
        value           nonuniform 0();
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform 0;
    }
    ACMI1_blockage
    {
        type            calculated;
        value           uniform 0;
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform 0;
    }
    ACMI2_blockage
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
